epernia/arm_book/programs/chapter_09/pruebas/embedded_server_feo_pero_anda/modules/esp8266_http_server/esp8266_http_server.cpp
/* Copyright 2017, Pablo Gomez - Agustin Bassi.
 * Copyright 2016, Marcelo Vieytes.
 * All rights reserved.
 *
 * This file is part sAPI library for microcontrollers.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 */

/* Date: 2017-14-11 */

/*==================[inlcusiones]============================================*/

#include "esp8266_http_server.h"

/*==================[definiciones y macros]==================================*/

//#define ESP8266_UART          UART_232 // FIXME: this!

#define ESP8266_BAUD_RATE     115200
#define ESP8266_TMO           5000
#define ESP8266_PAUSE         5000
#define ESP8266_WAIT          1000

#define MAX_COMMAND_LENGHT	   40
#define MAX_HTTP_WEB_LENGHT   1500

typedef enum Esp8266State {
   ESP_INIT,
   ESP_SEND_AT,
   ESP_WAIT_AT,
   ESP_SEND_CWJAP_CONS,
   ESP_WAIT_CWJAP_CONS_1,
   ESP_WAIT_CWJAP_CONS_2,
   ESP_SEND_CWMODE_SET,
   ESP_WAIT_CWMODE_SET,
   ESP_SEND_CWJAP_SET,
   ESP_WAIT_CWJAP_SET_1,
   ESP_WAIT_CWJAP_SET_2,
   ESP_WAIT_CWJAP_SET_3,
   ESP_CONNECTED,
   ESP_SEND_START,
   ESP_WAIT_START_1,
   ESP_WAIT_START_2,
   ESP_SEND_SEND,
   ESP_WAIT_SEND,
   ESP_SEND_DATA,
   ESP_WAIT_DATA_1,
   ESP_WAIT_DATA_2,
   ESP_CIPMUX_SEND,
   ESP_WAIT_CIPMUX,
   ESP_SEND_CIPSERVER,
   ESP_WAIT_CIPSERVER,
   ESP_WAIT_GET,
   ESP_SEND_CIPSTATUS,
   ESP_WAIT_CIPSTATUS_3,
   ESP_WAIT_GET_ID,
   ESP_SEND_CIPSEND,
   ESP_WAIT_CIPSEND,
   ESP_SEND_HTTP,
   ESP_WAIT_HTTP,
   ESP_WAIT_CIPSTATUS_OK,
   ESP_WAIT_CIPSTATUS,
   ESP_SEND_CIPCLOSE,
   ESP_WAIT_CIPCLOSE,
   ESP_SEND_CIFSR,
   ESP_WAIT_CIFSR,
   ESP_LOAD_IP,
   ESP_SEND_CWMODE,
   ESP_WAIT_CWMODE
} Esp8266Status_t;

/*==================[definiciones de datos internos]=========================*/

//Nombres de los estados en forma de strings para imprimir por pantalla.
static const char Esp8266StatusToString[][MAX_COMMAND_LENGHT] = {
   "ESP_INIT",
   "ESP_SEND_AT",
   "ESP_WAIT_AT",
   "ESP_SEND_CWJAP_CONS",
   "ESP_WAIT_CWJAP_CONS_1",
   "ESP_WAIT_CWJAP_CONS_2",
   "ESP_SEND_CWMODE_SET",
   "ESP_WAIT_CWMODE_SET",
   "ESP_SEND_CWJAP_SET",
   "ESP_WAIT_CWJAP_SET_1",
   "ESP_WAIT_CWJAP_SET_2",
   "ESP_WAIT_CWJAP_SET_3",
   "ESP_CONNECTED",
   "ESP_SEND_START",
   "ESP_WAIT_START_1",
   "ESP_WAIT_START_2",
   "ESP_SEND_SEND",
   "ESP_WAIT_SEND",
   "ESP_SEND_DATA",
   "ESP_WAIT_DATA_1",
   "ESP_WAIT_DATA_2",
   "ESP_CIPMUX_SEND",
   "ESP_WAIT_CIPMUX",
   "ESP_SEND_CIPSERVER",
   "ESP_WAIT_CIPSERVER",
   "ESP_WAIT_GET",
   "ESP_SEND_CIPSTATUS",
   "ESP_WAIT_CIPSTATUS_3",
   "ESP_WAIT_GET_ID",
   "ESP_SEND_CIPSEND",
   "ESP_WAIT_CIPSEND",
   "ESP_SEND_HTTP",
   "ESP_WAIT_HTTP",
   "ESP_WAIT_CIPSTATUS_OK",
   "ESP_WAIT_CIPSTATUS",
   "ESP_SEND_CIPCLOSE",
   "ESP_WAIT_CIPCLOSE",
   "ESP_SEND_CIFSR",
   "ESP_WAIT_CIFSR",
   "ESP_LOAD_IP",
   "ESP_SEND_CWMODE",
   "ESP_WAIT_CWMODE"
};

// Respuestas del ESP8266
static const char Response_OK[] = "OK";
static const char Response_CWJAP_OK[] = "+CWJAP:";
static const char Response_CWJAP_1[] = "WIFI CONNECTED";
static const char Response_CWJAP_2[] = "WIFI GOT IP";
static const char Response_SEND_OK[] = "SEND OK";
static const char Response_STATUS_3[] = "STATUS:3";
static const char Response_CIPSTATUS[] = "+CIPSTATUS:";
static const char Response_CIPCLOSE[] = "CLOSED";
static const char Response_CIFSR[] = "+CIFSR:STAIP,\"";

// Memoria asociada a las conexiones
static uint8_t CurrentConnectionId;
static char WifiName [30] = "";
static char WifiPass [30] = "";
static char WifiIp   [20];

// Punteros a la pagina web a mostrar
static char * PointerOfHttpBody;
static const char * PointerOfHttpHeader;
static const char * PointerOfHttpEnd;

// Variables utilizadas en la maquina de estados.
static const char * Esp8266ResponseToWait;
static uint8_t Esp8266Status = ESP_INIT;
static uint32_t Esp8266DebugBaudRate = 0;

static delay_t Esp8266Delay;

/*==================[definiciones de datos externos]=========================*/

//Serial uartEsp8266(D1, D0); // UART de BLE

// D42 = PE_8 = UART7_TX
// D41 = PE_7 = UART7_RX
Serial uartEsp8266( D42, D41 ); 

void uartEsp8266Init()
{
    uartEsp8266.baud(ESP8266_BAUD_RATE);
}

bool uartEsp8266CharRead( char* receivedChar )
{
    if( uartEsp8266.readable() ) {
        *receivedChar = uartEsp8266.getc();
        return true;
    }
    return false;
}

void uartEsp8266CharWrite( char c )
{
    uartEsp8266.putc(c);
}

void uartEsp8266StringWrite( char const* str )
{
    uartEsp8266.printf( "%s", str );
}


/*==================[declaraciones de funciones internas]====================*/

static bool IsWaitedResponse();
static void SetEsp8622Status( Esp8266Status_t status );
static void ExcecuteHttpServerFsm();

/*==================[declaraciones de funciones externas]====================*/


// Funcion para obtener la direccion IP del modulo Esp8266
// @return devuelve un puntero al arreglo local donde esta alojado el dato.
char * esp8266GetIpAddress()
{
   return WifiIp;
}

