epernia/arm_book/programs/chapter_09/pruebas/embedded_server_feo_pero_anda/modules/esp8266_http_server/esp8266_http_server.cpp
// Funcion para obtener el nombre de la red del modulo Esp8266
// @return devuelve un puntero al arreglo local donde esta alojado el dato.
char * esp8266GetWifiName()
{
   return WifiName;
}

// Funcion para obtener la contrasenia de la red del modulo Esp8266
// @return devuelve un puntero al arreglo local donde esta alojado el dato.
char * esp8266GetWifiPass()
{
   return WifiPass;
}

// Devuelve al usuario el indice de la conexion establecida
// @return un entero correspondiente a
uint8_t esp8266GetConnectionId()
{
   return CurrentConnectionId - '0';
}

// Configura la conexion para que el modulo Esp8266 sea un servidor HTTP.
// Realiza llamadas no bloqueantes a la maquina de estados que maneja la conexion.
// La variable parametersReceived sirve para cargar por unica vez los datos de la red
// @param wifiName puntero con el nombre de la red Wifi
// @param wifiPass puntero con la contrasenia de la red Wifi
// @param debugUart es la uart por donde va a reportar los datos. Este parametro es opcional, poner 0 sino se necesita.
// @param debugBaudRate es la velocidad de la uart de debug. Poner en 0 si no se necesita.
// @return TRUE si se configuro correctamente como servidor HTTP, FALSE caso contrario.
bool esp8266InitHttpServer( char const* wifiName, char const* wifiPass )
{
   static bool parametersReceived = FALSE;

   if (!parametersReceived) {
      strcpy(WifiName, wifiName);
      strcpy(WifiPass, wifiPass);
      SetEsp8622Status(ESP_INIT);
      parametersReceived = TRUE;
   }
   ExcecuteHttpServerFsm();

   return (Esp8266Status == ESP_SEND_CIPSTATUS);
}

// Funcion para determinar si hay alguna peticion HTTP realizada desde una
// pagina web, realizada por algun cliente.
// Ademas realiza llamadas no bloqueantes a la maquina de estados del
// modulo que administra las conexiones y peticiones de clientes.
// @return TRUE si se recibio una peticion, FALSE caso contrario.
bool esp8266ReadHttpServer()
{
   ExcecuteHttpServerFsm();
   return (Esp8266Status == ESP_SEND_CIPSEND);
}


// Funcion para enviar una pagina web actualizada en respuesta a la
// peticion del cliente.
// Corrobora quue haya una peticion real del usuario antes de enviar datos.
// Si hay una peticion, carga en los punteros correspondientes toda la
// pagina web que se le enviara al cliente.
// Un detalle importante es que tanto el header como el end de la web son
// constantes, ya que se supone que no cambian a lo largo del programa.
// Lo que si cambiara es el body HTTP que es el que contiene la informacion
// actualizada del estado del sistema.
// @param webHttpHeader puntero al header http (debe ser parte de la aplicacion de usuario).
// @param webHttpBody puntero al body http (debe ser parte de la aplicacion de usuario).
// @param webHttpEnd puntero al end http (debe ser parte de la aplicacion de usuario).
// @return TRUE si pudo mandar la web correctamente, FALSE caso contrario.
bool esp8266WriteHttpServer( char const* webHttpHeader, 
                             char* webHttpBody, 
                             char const* webHttpEnd )
{
   //antes de enviar se asegura que haya datos pendientes para enviar
   if (Esp8266Status == ESP_SEND_CIPSEND) {
      PointerOfHttpHeader = webHttpHeader;
      PointerOfHttpBody   = webHttpBody;
      PointerOfHttpEnd    = webHttpEnd;
   }
   ExcecuteHttpServerFsm();

   return (Esp8266Status == ESP_SEND_CIPCLOSE);
}

/*==================[definiciones de funciones internas]=====================*/

// Funcion principal del modulo Wifi Esp8266 para funcionar como servidor HTTP.
// Desde aca se manejan los comandos a enviar, los tiempos a esperar y
// las respuestas a recibir.
// Automaticamente cambia de estados en funcion de los eventos que ocurran.
static void ExcecuteHttpServerFsm(void)
{
   uint16_t lenghtOfHttpLines;
   static uint8_t auxIndex;
   static char byteReceived;

   char strToSend[50];

   switch (Esp8266Status) {

      case ESP_INIT:
         //uartConfig(ESP8266_UART, ESP8266_BAUD_RATE);
         if (Esp8266DebugBaudRate > 0) {
//            uartConfig(Esp8266DebugUart, Esp8266DebugBaudRate);
            uartEsp8266Init();
         }
         delayConfig(&Esp8266Delay, ESP8266_PAUSE);
         SetEsp8622Status(ESP_SEND_AT);
      break;

      case ESP_SEND_AT:
         if (delayRead(&Esp8266Delay)) {
//            stdioPrintf(ESP8266_UART, "AT\r\n");
            uartEsp8266StringWrite( "AT\r\n" );
            Esp8266ResponseToWait = Response_OK;
            delayConfig(&Esp8266Delay, ESP8266_TMO);
            SetEsp8622Status(ESP_WAIT_AT);
         }
      break;

      case ESP_WAIT_AT:
         if (IsWaitedResponse()) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CWMODE);
         }
         //Si no recibe OK vuelve a enviar AT
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_AT);
         }
      break;

      case ESP_SEND_CWMODE:
         if (delayRead(&Esp8266Delay)) {
//            stdioPrintf(ESP8266_UART, "AT+CWMODE=3\r\n");
            uartEsp8266StringWrite( "AT+CWMODE=3\r\n" );
            Esp8266ResponseToWait = Response_OK;
            delayConfig(&Esp8266Delay, ESP8266_TMO);
            SetEsp8622Status(ESP_WAIT_CWMODE);
         }
      break;

      case ESP_WAIT_CWMODE:
         if (IsWaitedResponse()) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CWJAP_CONS);
         }
         //Si no recibe OK vuelve a enviar AT
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CWMODE);
         }
      break;

      case ESP_SEND_CWJAP_CONS:
         if (delayRead(&Esp8266Delay)) {
//            stdioPrintf(ESP8266_UART, "AT+CWJAP?\r\n");
            uartEsp8266StringWrite( "AT+CWJAP?\r\n" );
            Esp8266ResponseToWait = Response_CWJAP_OK;
            delayConfig(&Esp8266Delay, ESP8266_TMO);
            SetEsp8622Status(ESP_WAIT_CWJAP_CONS_1);
         }
      break;

      case ESP_WAIT_CWJAP_CONS_1:
         if (IsWaitedResponse()) {
            Esp8266ResponseToWait = Response_OK;
            SetEsp8622Status(ESP_WAIT_CWJAP_CONS_2);
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CWMODE_SET);
         }
      break;

      case ESP_WAIT_CWJAP_CONS_2:
         if (IsWaitedResponse()) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_CIPMUX_SEND);
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_AT);
         }
      break;

      case ESP_SEND_CWMODE_SET:
         if (delayRead(&Esp8266Delay)) {
//            stdioPrintf(ESP8266_UART, "AT+CWMODE=3\r\n");
            uartEsp8266StringWrite( "AT+CWMODE=3\r\n" );
            Esp8266ResponseToWait = Response_OK;
            delayConfig(&Esp8266Delay, ESP8266_TMO);
            SetEsp8622Status(ESP_WAIT_CWMODE_SET);
         }
      break;

      case ESP_WAIT_CWMODE_SET:
         if (IsWaitedResponse()) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CWJAP_SET);
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_AT);
         }
      break;

      case ESP_SEND_CWJAP_SET:
         if (delayRead(&Esp8266Delay)) {
//            stdioPrintf(ESP8266_UART, "AT+CWJAP=\"%s\",\"%s\"", WifiName, WifiPass);
            uartEsp8266StringWrite( "AT+CWJAP=\"" );
            uartEsp8266StringWrite( WifiName );
            uartEsp8266StringWrite( "\",\"" );
            uartEsp8266StringWrite( WifiPass );
            uartEsp8266StringWrite( "\"\r\n" );
            Esp8266ResponseToWait = Response_CWJAP_1;
            delayConfig(&Esp8266Delay, ESP8266_TMO);
            SetEsp8622Status(ESP_WAIT_CWJAP_SET_1);
         }
      break;

      case ESP_WAIT_CWJAP_SET_1:
         if (IsWaitedResponse()) {
            Esp8266ResponseToWait = Response_CWJAP_2;
            SetEsp8622Status(ESP_WAIT_CWJAP_SET_2);
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_AT);
         }
         break;

      case ESP_WAIT_CWJAP_SET_2:
         if (IsWaitedResponse()) {
            Esp8266ResponseToWait = Response_OK;
            SetEsp8622Status(ESP_WAIT_CWJAP_SET_3);
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_AT);
         }
      break;

      case ESP_WAIT_CWJAP_SET_3:
         if (IsWaitedResponse())
            SetEsp8622Status(ESP_CIPMUX_SEND);
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_AT);
         }
      break;

      case ESP_CIPMUX_SEND:
         if (delayRead(&Esp8266Delay)) {
//            stdioPrintf(ESP8266_UART, "AT+CIPMUX=1\r\n");
            uartEsp8266StringWrite( "AT+CIPMUX=1\r\n" );
            Esp8266ResponseToWait = Response_OK;
            delayConfig(&Esp8266Delay, ESP8266_TMO);
            SetEsp8622Status(ESP_WAIT_CIPMUX);
            auxIndex=0;
         }
      break;

      case ESP_WAIT_CIPMUX:
         if (IsWaitedResponse()) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CIPSERVER);
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            // cierra todas las posibles conexioes
//            stdioPrintf(ESP8266_UART, "AT+CIPCLOSE=%d\r\n", auxIndex);
            uartEsp8266StringWrite( "AT+CIPCLOSE=" );
            uartEsp8266CharWrite( auxIndex + 48 ); // auxIndex no puede ser mayor a 9
            uartEsp8266StringWrite( "\r\n" );
            if (++auxIndex >= 4) {
               SetEsp8622Status(ESP_CIPMUX_SEND);
            }
         }
      break;

      case ESP_SEND_CIPSERVER:
         if (delayRead(&Esp8266Delay)) {
//            stdioPrintf(ESP8266_UART, "AT+CIPSERVER=1,80\r\n");
            uartEsp8266StringWrite( "AT+CIPSERVER=1,80\r\n" );
            Esp8266ResponseToWait = Response_OK;
            delayConfig(&Esp8266Delay, ESP8266_TMO);
            SetEsp8622Status(ESP_WAIT_CIPSERVER);
         }
      break;

      case ESP_WAIT_CIPSERVER:
         if (IsWaitedResponse()) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CIFSR);
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_AT);
         }
      break;

