epernia/arm_book/programs/chapter_09/pruebas/embedded_server_feo_pero_anda/modules/esp8266_http_server/esp8266_http_server.cpp
      case ESP_SEND_CIFSR:
         if (delayRead(&Esp8266Delay)) {
//            stdioPrintf(ESP8266_UART, "AT+CIFSR\r\n");
            uartEsp8266StringWrite( "AT+CIFSR\r\n" );
            Esp8266ResponseToWait = Response_CIFSR;
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_WAIT_CIFSR);
         }
      break;

      case ESP_WAIT_CIFSR:
         if (IsWaitedResponse()) {
            SetEsp8622Status(ESP_LOAD_IP);
            auxIndex=0;
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CIFSR);
         }
      break;

      //Recibe byte a byte la direccion IP y la almacena en WifiIp
      case ESP_LOAD_IP:
//         if (uartReadByte(ESP8266_UART, &byteReceived)) {
         if( uartEsp8266CharRead(&byteReceived) ){
            if (byteReceived != '"') {
               WifiIp [auxIndex] = byteReceived;
               auxIndex++;
            } else {
               WifiIp [auxIndex] = '\0';
               SetEsp8622Status(ESP_SEND_CIPSTATUS);
            }
         }
      break;

      // En este estado el modulo ya esta configurado como servidor HTTP
      // entonces cada vez que pasa el delay ESP8266_PAUSE mediante
      // el compando CIP_STATUS le pregunta al moduloWifi si hay una nueva peticion
      case ESP_SEND_CIPSTATUS:
         if (delayRead(&Esp8266Delay)) {
//            stdioPrintf(ESP8266_UART, "AT+CIPSTATUS\r\n");
            uartEsp8266StringWrite( "AT+CIPSTATUS\r\n" );
            Esp8266ResponseToWait = Response_STATUS_3;
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_WAIT_CIPSTATUS_3);
         }
      break;

      case ESP_WAIT_CIPSTATUS_3:
         if (IsWaitedResponse()) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            Esp8266ResponseToWait = Response_CIPSTATUS;
            SetEsp8622Status(ESP_WAIT_CIPSTATUS);
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CIPSTATUS);
         }
      break;

      case ESP_WAIT_CIPSTATUS:
         if (IsWaitedResponse()) {
            SetEsp8622Status(ESP_WAIT_GET_ID);
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CIPSTATUS);
         }
      break;

      case ESP_WAIT_GET_ID:
//         if (uartReadByte(ESP8266_UART, &byteReceived)) {
         if( uartEsp8266CharRead(&byteReceived) ){
            CurrentConnectionId = byteReceived;
            Esp8266ResponseToWait = Response_OK;
            SetEsp8622Status(ESP_WAIT_CIPSTATUS_OK);
            auxIndex = 0;
         }
      break;

      case ESP_WAIT_CIPSTATUS_OK:
         if (IsWaitedResponse()) {
            SetEsp8622Status(ESP_SEND_CIPSEND);
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CIPSTATUS);
         }
      break;

      //En este estado le dice al modulo cuantos bytes va a mandar
      // El comando esta compuesto por el comando CIPSEND, mas el ID
      // de la conexion abierta, mas la cantidad en ASCII de los bytes
      // que tiene la pagina web (o al menos los bytes de la primer linea).
      case ESP_SEND_CIPSEND:
         lenghtOfHttpLines = (strlen(PointerOfHttpHeader) + strlen(PointerOfHttpBody) + strlen(PointerOfHttpEnd));
         // Si se pasa del maximo largo permitido lo avisa en la web
         if (lenghtOfHttpLines >= MAX_HTTP_WEB_LENGHT) {
//            stdioSprintf(PointerOfHttpBody, "ERROR: La longitud de datos HTTP supera el maximo permitido de %d bytes.", MAX_HTTP_WEB_LENGHT);
            sprintf( PointerOfHttpBody, "ERROR: La longitud de datos HTTP supera el maximo permitido de %d bytes.", MAX_HTTP_WEB_LENGHT) ;
            lenghtOfHttpLines = (strlen(PointerOfHttpHeader) + strlen(PointerOfHttpBody) + strlen(PointerOfHttpEnd));
         }
//         stdioPrintf(ESP8266_UART, "AT+CIPSEND=%c,%d\r\n", CurrentConnectionId, lenghtOfHttpLines);
        sprintf( strToSend, "AT+CIPSEND=%c,%d\r\n", CurrentConnectionId, lenghtOfHttpLines );
        uartEsp8266StringWrite( strToSend );

         SetEsp8622Status(ESP_WAIT_CIPSEND);
         Esp8266ResponseToWait = Response_OK;
      break;

      case ESP_WAIT_CIPSEND:
         if (IsWaitedResponse()) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_HTTP);
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CIPSTATUS);
         }
      break;

      case ESP_SEND_HTTP:
//         stdioPrintf(ESP8266_UART, "%s%s%s", PointerOfHttpHeader, PointerOfHttpBody, PointerOfHttpEnd);
        uartEsp8266StringWrite( PointerOfHttpHeader );
        uartEsp8266StringWrite( PointerOfHttpBody );
        uartEsp8266StringWrite( PointerOfHttpEnd );

         SetEsp8622Status(ESP_WAIT_HTTP);
         Esp8266ResponseToWait = Response_SEND_OK;
      break;

      case ESP_WAIT_HTTP:
         if (IsWaitedResponse()) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CIPCLOSE);
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CIPSEND);
         }
      break;

      case ESP_SEND_CIPCLOSE:
         if (delayRead(&Esp8266Delay)) {
//            stdioPrintf(ESP8266_UART, "AT+CIPCLOSE=%c\r\n", CurrentConnectionId);
            sprintf( strToSend, "AT+CIPCLOSE=%c\r\n", CurrentConnectionId );
            uartEsp8266StringWrite( strToSend );
            Esp8266ResponseToWait  = Response_CIPCLOSE;
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_WAIT_CIPCLOSE);
         }
      break;

      case ESP_WAIT_CIPCLOSE:
         if (IsWaitedResponse()) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CIPSTATUS);
         }
         if (delayRead(&Esp8266Delay)) {
            delayConfig(&Esp8266Delay, ESP8266_PAUSE);
            SetEsp8622Status(ESP_SEND_CIPSTATUS);
         }
      break;
   }
}

