epernia/arm_book/programs/chapter_09/pruebas/embedded_server_feo_pero_anda/modules/esp8266_http_server/esp8266_http_server.cpp
// Determina si la respuesta que envio el modulo Esp8266 al
// sistema embebido sea correcta.
// Dentro de esta funcion va leyendo datos de la UART asociada
// al modulo Esp8266 hasta encontrar el patron de datos necesario.
// @return TRUE si es la respuesta esperada, FALSE caso contrario.
static bool IsWaitedResponse(void)
{
   static uint8_t index = 0;
   char charReceived;
   bool moduleResponse = FALSE;

//   if (uartReadByte(ESP8266_UART, &charReceived)) {
   if( uartEsp8266CharRead(&charReceived) ){

      if (Esp8266DebugBaudRate > 0) {
//        stdioPrintf(Esp8266DebugUart, "%c", charReceived);
        pcSerialComCharWrite( charReceived );
      }
      if (charReceived == Esp8266ResponseToWait[index]) {
         index++;
         if (Esp8266ResponseToWait[index] == '\0') {
            index = 0;
            moduleResponse = TRUE;
            if (Esp8266DebugBaudRate > 0) {
//               stdioPrintf(Esp8266DebugUart, "\n\r");
                pcSerialComStringWrite( "\r\n" );
            }
         }
      } else {
         index = 0;
      }
   }

   return moduleResponse;
}

/**
 * Setea el estado global del modulo Esp8266.
 * @param status Estado a setear.
 */
static void SetEsp8622Status( Esp8266Status_t status )
{
    char strToSend[100];
    Esp8266Status = status;
    if (Esp8266DebugBaudRate > 0) {
//		stdioPrintf(Esp8266DebugUart, "\n\rESP8266 State = %s\n\r", Esp8266StatusToString[status]);
        sprintf( strToSend, "\n\rESP8266 State = %s\n\r", Esp8266StatusToString[status] );
        pcSerialComStringWrite( strToSend );
   }
}

/*==================[fin del archivo]========================================*/
